Функция ВыполнитьОбновлениеИнформационнойБазы()
	
	МодульОбновлениеИнформационнойБазы = Метаданные.ОбщиеМодули.Найти("ОбновлениеИнформационнойБазы");
	
	Если МодульОбновлениеИнформационнойБазы = Неопределено Тогда
		
		Возврат Истина;
	Иначе 
		
		Результат = ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы(Истина);
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции // ()
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	

	РезультатОбновления = ВыполнитьОбновлениеИнформационнойБазы();
	Сообщить(СтрШаблон("Завершение обновление. Результат <%1>", РезультатОбновления));
	
	ЗавершитьРаботуСистемы(Ложь, Ложь);

КонецПроцедуры
