#Использовать v8runner
#Использовать fs
#Использовать logos
#Использовать 1commands
#Использовать tempfiles
#Использовать "../src/core/Классы/internal/"
Перем КаталогПроекта;
Перем Лог;

Процедура ПолезнаяРабота()

	// УправлениеКонфигуратором = Новый УправлениеКонфигуратором();
	// ПутьК1С = УправлениеКонфигуратором.ПолучитьПутьКВерсииПлатформы("8.3");

	// ФайлЗапуска1С = Новый Файл(ПутьК1С);

	// ПутьКАгенту = ОбъединитьПути(ФайлЗапуска1С.Путь, "ragent.exe");
	// КаталогХламаАгента = ОбъединитьПути(КаталогПроекта, ".ragent");

	// ФС.ОбеспечитьКаталог(КаталогХламаАгента);

	// Лог.Информация("Установка пакета библиотеки");
	// КомандаАгента = Новый ПараллельнаяКоманда;
	// КомандаАгента.УстановитьРабочийКаталог(КаталогХламаАгента);
	// КомандаАгента.УстановитьКоманду(ПутьКАгенту);
	// КомандаАгента.ДобавитьПараметр("-agent");	
	// КомандаАгента.ДобавитьПараметр("-d");	
	// КомандаАгента.ДобавитьПараметр(КаталогХламаАгента);
	// ПроцессАгента = КомандаАгента.ЗапуститьПроцесс();



КонецПроцедуры


КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

Лог = Логирование.ПолучитьЛог("oscript.tasks");

ПолезнаяРабота();

