
&НаСервере
Функция ОбработатьДанныхОбновленияНаСервер(ДанныеОбновленияРасширений)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЛогОбработки = ОбработкаОбъект.ОбработатьДанныхОбновления(ДанныеОбновленияРасширений);
	
	Возврат ЛогОбработки;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ВыполнитьОбновление(Неопределено);           
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыполнитьОбновление(Команда)

	ПутьКФайлуОбновленияРасширения = ПараметрЗапуска;
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлуОбновленияРасширения) Тогда
		ЗавершитьРаботуСистемы(Ложь, Ложь);                  
		Возврат;
	КонецЕсли;
					
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ПутьКФайлуОбновленияРасширения);
	ДанныеОбновленияРасширений = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	НаборРасширений = ДанныеОбновленияРасширений.НаборРасширений;
	ПутьКФайлуЛога = ДанныеОбновленияРасширений.ПутьКФайлуЛога;
	ЗагрузкаОбновленийРасширений = ДанныеОбновленияРасширений.ЗагрузкаОбновленийРасширений;
	
	Для Каждого Стр Из НаборРасширений Цикл
		
		Если ЗначениеЗаполнено(Стр.ПутьКФайлуОбновления)
			И ЗагрузкаОбновленийРасширений Тогда
			
			ДанныеОбновленияРасширения = Новый ДвоичныеДанные(Стр.ПутьКФайлуОбновления);
			
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДанныеОбновленияРасширения, ЭтаФорма.УникальныйИдентификатор);
			
			Стр.Вставить("АдресВременногоХранилища", АдресВременногоХранилища); 
	          		
		КонецЕсли; 
		
	КонецЦикла;
	
	ДанныеЛога = ОбработатьДанныхОбновленияНаСервер(ДанныеОбновленияРасширений);
	
	ЗаписатьЛогПараметров(ПутьКФайлуЛога, ДанныеЛога);
		
	ЗавершитьРаботуСистемы(Ложь, Ложь);   

КонецПроцедуры // ВыполнитьОбновление()
 


&НаКлиенте
Процедура ЗаписатьЛогПараметров(ПутьКФайлу, ДанныеЛога) Экспорт
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, "UTF-8",, ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, ДанныеЛога);
	
    ЗаписьJSON.Закрыть();
	
КонецПроцедуры

