// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

Перем БДД; //контекст фреймворка 1bdd

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯОтправляюНастройкуОбновленияВОчередьИзФайла");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

// Процедура выполняется перед запуском каждого сценария
Процедура ПередЗапускомСценария(Знач Узел) Экспорт
	
КонецПроцедуры

// Процедура выполняется после завершения каждого сценария
Процедура ПослеЗапускаСценария(Знач Узел) Экспорт
	
КонецПроцедуры

//Я отправляю настройку обновления в очередь из файла "./fixtures/test-arfifactory.yaml"
Процедура ЯОтправляюНастройкуОбновленияВОчередьИзФайла(Знач ПутьКФайлу) Экспорт
	
	КаталогФайловойБазы = БДД.ПолучитьИзКонтекста("ТестоваяБаза");

	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ПутьКФайлу);
	ТекстYaml = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	ТекстYaml = СтрЗаменить(ТекстYaml, "<ТестоваяБаза>", КаталогФайловойБазы );

	Процессор = Новый ПарсерYAML;
	Результат = Процессор.ПрочитатьYaml(ТекстYaml);

	ОсновныеДанные = Результат["payload"];
		
	ОчередьОбновленияRMQ = БДД.ПолучитьИзКонтекста("ОчередьОбновленияRMQ");
	ОчередьОбновленияRMQ.ОтправитьДанныеВОчередь(ОсновныеДанные,
						Результат["properties"],
						Результат["routing_key"]);

	Приостановить(10*1000); // 3 сек задержкиКонецПроцедуры

КонецПроцедуры
