//    Copyright 2018 khorevaa
// 
//    Licensed under the Apache License, Version 2.0 (the "License");
//    you may not use this file except in compliance with the License.
//    You may obtain a copy of the License at
// 
//        http://www.apache.org/licenses/LICENSE-2.0
// 
//    Unless required by applicable law or agreed to in writing, software
//    distributed under the License is distributed on an "AS IS" BASIS,
//    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//    See the License for the specific language governing permissions and
//    limitations under the License.

Процедура ОписаниеКоманды(Команда) Экспорт
	
	Команда.Опция("rmq-user ru", "", "пользователь сервера RabbitMQ")
				.ВОкружении("RMQ_USER");

	Команда.Опция("rmq-pwd rp", "", "пароль пользователя сервера RabbitMQ")
				.ВОкружении("RMQ_PWD RMQ_PASSWORD");

	Команда.Опция("rmq-queue rq", "", "имя очереди получения сообщений на сервере RabbitMQ")
				.ВОкружении("RMQ_QUEUE");
	
	Команда.Опция("rmq-port", 15672, "порт сервера RabbitMQ")
				.ВОкружении("RMQ_PORT");

	Команда.Опция("rmq-exchange-name re", "", "имя точки ответа сервера RabbitMQ")
				.ВОкружении("RMQ_EXCHANGE_NAME");

	Команда.Опция("rmq-routing-key rr", "", "ключ маршрутизации сервера RabbitMQ")
				.ВОкружении("RMQ_ROUTING_KEY");
	
	Команда.Опция("rmq-virtual-host rmq-vhost rv", "%2F", "виртуальный хост на сервере RabbitMQ")
				.ВОкружении("RMQ_VHOST");

	Команда.Опция("t queue-timer", 60, "таймер опроса сервера очереди");

	Команда.Опция("W worker", Ложь, "запуск одиночного рабочего процесса агента");
	Команда.Опция("d worker-dir", "", "рабочий каталог процесса агента")
				.ПоУмолчанию(ПараметрыПриложения.КаталогДанныхПриложения()); 

	Команда.Опция("workers-dir", "", "рабочий каталог процессов")
				.ПоУмолчанию(ПараметрыПриложения.КаталогДанныхПриложения()); 

	Команда.Опция("M workers-max-count", 0, "количество рабочих процессов агента (0 - автоматический расчет)");
	Команда.Опция("T worker-timeuot", 0, "таймаут перезапуска рабочего процесса агента при зависании");

	Команда.Аргумент("SERVER", "", "Адрес сервера RabbitMQ")
				.ВОкружении("RMQ_SERVER");

	Команда.Аргумент("UID", Строка(Новый УникальныйИдентификатор), "идентификатор запущенного рабочего процесса агента")
				.Обязательный(Ложь);

КонецПроцедуры

Процедура ВыполнитьКоманду(Знач Команда) Экспорт
	
	ЭтоРабочийПроцессаАгента = Команда.ЗначениеОпции("worker");

	ПользовательRMQ = Команда.ЗначениеОпции("ru");
	ПарольRMQ = Команда.ЗначениеОпции("rp");

	ИмяОчереди = Команда.ЗначениеОпции("rq");
	ТочкаОбмена = Команда.ЗначениеОпции("re");
	ВиртуальныйХост = Команда.ЗначениеОпции("rv");
	ПортСервера =  Команда.ЗначениеОпции("rmq-port");
	АдресСервера = Команда.ЗначениеАргумента("SERVER");
	ИдентификаторАгента = Команда.ЗначениеАргумента("UID");
	РабочийКаталогАгента = Команда.ЗначениеОпции("worker-dir");

	ТаймерОпросаОчереди = Команда.ЗначениеОпции("queue-timer");
	РабочийКаталогПроцессов = Команда.ЗначениеОпции("workers-dir");
	МаксимальноеКоличествоРабочихПроцессов = Команда.ЗначениеОпции("workers-max-count");
	ТаймаутРабочегоПроцесса = Команда.ЗначениеОпции("worker-timeuot");

	НастройкаRMQ = Новый Структура;
	НастройкаRMQ.Вставить("Сервер", АдресСервера);
	НастройкаRMQ.Вставить("Порт", ПортСервера);
	НастройкаRMQ.Вставить("Пользователь", ПользовательRMQ);
	НастройкаRMQ.Вставить("Пароль", ПарольRMQ);
	НастройкаRMQ.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	НастройкаRMQ.Вставить("ИмяОчереди", ИмяОчереди);
	НастройкаRMQ.Вставить("ТочкаОбмена", ТочкаОбмена);

	Если ЭтоРабочийПроцессаАгента Тогда
		ЗапуститьАгента(ИдентификаторАгента, РабочийКаталогАгента, НастройкаRMQ);
	Иначе

		МенеджерРабочийПроцессов = Новый МенеджерАгентов();
		
		МенеджерРабочийПроцессов.НастроитьRMQ(НастройкаRMQ);

		МенеджерРабочийПроцессов.УстановитьКоличествоАгентов(МаксимальноеКоличествоРабочихПроцессов);	
		МенеджерРабочийПроцессов.УстановитьТаймерОпроса(ТаймерОпросаОчереди);
		МенеджерРабочийПроцессов.УстановитьТаймаутПроцессаАгента(ТаймаутРабочегоПроцесса);
		МенеджерРабочийПроцессов.УстановитьРабочийКаталогПроцессов(РабочийКаталогПроцессов);

		ПараметрыЗапускаАгента = Новый Структура;
		ПараметрыЗапускаАгента.Вставить("НастройкаRMQ", НастройкаRMQ);
		ПараметрыЗапускаАгента.Вставить("РабочийКаталогПроцессов", РабочийКаталогПроцессов);

		МенеджерРабочийПроцессов.УстановитьПараметрыАгента(ПараметрыЗапускаАгента);

		МенеджерРабочийПроцессов.Запустить();

	КонецЕсли;

КонецПроцедуры

Процедура ЗапуститьАгента(ИдентификаторАгента, РабочийКаталогПроцесса, НастройкаRMQ)
	
	Агент = Новый АгентОчередиОбновления(ИдентификаторАгента);
	Агент.НастроитьRMQ(НастройкаRMQ);
	Агент.РабочийКаталог(РабочийКаталогПроцесса);
	Агент.Запустить();

КонецПроцедуры